
<details><summary>Show Format output</summary>

```terraform

main.tf
::error::Terraform exited with code 3.
```

</details>

<details><summary>Show Init output</summary>

```terraform

[0m[1mInitializing HCP Terraform...[0m
[0m[1mInitializing modules...[0m
- app in app
- db in db
- vpc in shared
[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v5.87.0...
- Installed hashicorp/aws v5.87.0 (signed by HashiCorp)
Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mHCP Terraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with HCP Terraform. Try running "terraform plan" to
see any changes that are required for your infrastructure.

If you ever set or change modules or Terraform Settings, run "terraform init"
again to reinitialize your working directory.[0m
```

</details>

<details><summary>Show Validate output</summary>

```terraform

Success! The configuration is valid.
```

</details>

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/postech-fiap-alura/totem-express/runs/run-BQtJmwDgN3zBjJNQ

Waiting for the plan to start...

Terraform v1.10.0
on linux_amd64
Initializing plugins and modules...
data.aws_availability_zones.available: Refreshing...
module.app.data.aws_iam_role.labrole: Refreshing...
module.app.data.aws_availability_zones.available: Refreshing...
module.vpc.aws_vpc.totem_express_vpc: Refreshing state... [id=vpc-019fc174a3477be9c]
module.vpc.data.aws_availability_zones.available: Refreshing...
module.app.aws_ecr_repository.ecr_payments_repository: Refreshing state... [id=totem_express_payments]
module.app.aws_ecr_repository.ecr_users_repository: Refreshing state... [id=totem_express_users]
module.app.aws_ecr_repository.ecr_order_product_repository: Refreshing state... [id=totem_express_order_product]
module.app.data.aws_iam_role.labrole: Refresh complete after 0s [id=LabRole]
module.app.data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
module.vpc.data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
module.db.aws_security_group.db_payments_sg: Refreshing state... [id=sg-0ccde2df22dd618b9]
module.vpc.aws_subnet.totem_express_subnets[1]: Refreshing state... [id=subnet-0018e501602c22f59]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0eb06f4d0ed34b4f5]
module.vpc.aws_subnet.totem_express_subnets[0]: Refreshing state... [id=subnet-0eab3366c13a13308]
module.vpc.aws_security_group.ssh_cluster: Refreshing state... [id=sg-098d02175f075149d]
module.db.aws_security_group.db_order_product_sg: Refreshing state... [id=sg-013dd5197b87e64f8]
module.vpc.aws_route_table.public_routetable: Refreshing state... [id=rtb-03f03eeff3a82dd19]
module.db.aws_db_subnet_group.payments_subnet_group: Refreshing state... [id=totem-express-pagamentos-subnet-group]
module.db.aws_db_subnet_group.order_product_subnet_group: Refreshing state... [id=totem-express-produtos-pedidos-subnet-group]
module.app.aws_eks_cluster.eks-cluster: Refreshing state... [id=totem_express-8soat]
module.vpc.aws_route_table_association.public_rt_association[0]: Refreshing state... [id=rtbassoc-05139b13ad84c5419]
module.vpc.aws_route_table_association.public_rt_association[1]: Refreshing state... [id=rtbassoc-0dd1312630c8f3293]
module.db.aws_db_instance.db-order-product: Refreshing state... [id=db-V4PU3JQOQXAW5SXIMR6TLJLRVU]
module.db.aws_db_instance.db-payments: Refreshing state... [id=db-HIHRTEDQ3DBZCXSGKSWPXGFBBA]
module.app.aws_eks_access_policy_association.eks-policy: Refreshing state... [id=totem_express-8soat#arn:aws:iam::924978846501:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.app.aws_eks_access_entry.access-entry: Refreshing state... [id=totem_express-8soat:arn:aws:iam::924978846501:role/voclabs]
module.app.aws_eks_node_group.node-group: Refreshing state... [id=totem_express-8soat:totem_express-ng]
module.app.aws_eks_cluster.eks-cluster: Drift detected (delete)
module.app.aws_ecr_repository.ecr_payments_repository: Drift detected (delete)
module.app.aws_ecr_repository.ecr_users_repository: Drift detected (delete)
module.app.aws_ecr_repository.ecr_order_product_repository: Drift detected (delete)
module.app.aws_eks_node_group.node-group: Drift detected (delete)
module.app.aws_eks_access_policy_association.eks-policy: Drift detected (delete)
module.app.aws_eks_access_entry.access-entry: Drift detected (delete)
module.db.aws_db_subnet_group.order_product_subnet_group: Drift detected (delete)
module.db.aws_db_subnet_group.payments_subnet_group: Drift detected (delete)
module.db.aws_security_group.db_order_product_sg: Drift detected (delete)
module.db.aws_security_group.db_payments_sg: Drift detected (delete)
module.db.aws_db_instance.db-order-product: Drift detected (delete)
module.db.aws_db_instance.db-payments: Drift detected (delete)
module.vpc.aws_internet_gateway.igw: Drift detected (delete)
module.vpc.aws_route_table.public_routetable: Drift detected (delete)
module.vpc.aws_route_table_association.public_rt_association[0]: Drift detected (delete)
module.vpc.aws_route_table_association.public_rt_association[1]: Drift detected (delete)
module.vpc.aws_security_group.ssh_cluster: Drift detected (delete)
module.vpc.aws_subnet.totem_express_subnets[1]: Drift detected (delete)
module.vpc.aws_subnet.totem_express_subnets[0]: Drift detected (delete)
module.vpc.aws_vpc.totem_express_vpc: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.app.aws_eks_cluster.eks-cluster has been deleted
  - resource "aws_eks_cluster" "eks-cluster" {
        id                            = "totem_express-8soat"
      - name                          = "totem_express-8soat" -> null
        tags                          = {}
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.db.aws_db_subnet_group.order_product_subnet_group has been deleted
  - resource "aws_db_subnet_group" "order_product_subnet_group" {
        id                      = "totem-express-produtos-pedidos-subnet-group"
      - name                    = "totem-express-produtos-pedidos-subnet-group" -> null
        tags                    = {
            "Name" = "totem-express-produtos-pedidos-subnet-group"
        }
        # (7 unchanged attributes hidden)
    }

  # module.db.aws_db_subnet_group.payments_subnet_group has been deleted
  - resource "aws_db_subnet_group" "payments_subnet_group" {
        id                      = "totem-express-pagamentos-subnet-group"
      - name                    = "totem-express-pagamentos-subnet-group" -> null
        tags                    = {
            "Name" = "totem-express-pagamentos-subnet-group"
        }
        # (7 unchanged attributes hidden)
    }

  # module.db.aws_security_group.db_order_product_sg has been deleted
  - resource "aws_security_group" "db_order_product_sg" {
      - id                     = "sg-013dd5197b87e64f8" -> null
        name                   = "totem-express-produtos-pedidos-sg"
        tags                   = {
            "Name" = "totem-express-produtos-pedidos-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.db.aws_security_group.db_payments_sg has been deleted
  - resource "aws_security_group" "db_payments_sg" {
      - id                     = "sg-0ccde2df22dd618b9" -> null
        name                   = "totem-express-pagamentos-sg"
        tags                   = {
            "Name" = "totem-express-pagamentos-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.igw has been deleted
  - resource "aws_internet_gateway" "igw" {
      - id       = "igw-0eb06f4d0ed34b4f5" -> null
        tags     = {
            "Name" = "totem-express-igw"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public_routetable has been deleted
  - resource "aws_route_table" "public_routetable" {
      - id               = "rtb-03f03eeff3a82dd19" -> null
        tags             = {
            "Name" = "totem-express-public-rt"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_security_group.ssh_cluster has been deleted
  - resource "aws_security_group" "ssh_cluster" {
      - id                     = "sg-098d02175f075149d" -> null
        name                   = "terraform-20250216232444753100000001"
        tags                   = {
            "name" = "totem-express-ssh-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.totem_express_vpc has been deleted
  - resource "aws_vpc" "totem_express_vpc" {
      - cidr_block                           = "10.0.0.0/24" -> null
      - id                                   = "vpc-019fc174a3477be9c" -> null
        tags                                 = {}
        # (18 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app.aws_ecr_repository.repository will be created
  + resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "totem_express"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.app.aws_eks_access_entry.access-entry will be created
  + resource "aws_eks_access_entry" "access-entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "totem_express-8soat"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "8soat",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::479819428824:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.app.aws_eks_access_policy_association.eks-policy will be created
  + resource "aws_eks_access_policy_association" "eks-policy" {
      + associated_at = (known after apply)
      + cluster_name  = "totem_express-8soat"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::479819428824:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.app.aws_eks_cluster.eks-cluster will be created
  + resource "aws_eks_cluster" "eks-cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "totem_express-8soat"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::602275567391:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.app.aws_eks_node_group.node-group will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "totem_express-8soat"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.medium",
        ]
      + node_group_name        = "totem_express-ng"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::602275567391:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.db.aws_db_instance.db-order-product will be created
  + resource "aws_db_instance" "db-order-product" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "totem-express-produtos-pedidos-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.4.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "totem-express-produtos-pedidos"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "totem-express-produtos-pedidos"
        }
      + tags_all                              = {
          + "Name" = "totem-express-produtos-pedidos"
        }
      + timezone                              = (known after apply)
      + username                              = "postech_admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.db.aws_db_instance.db-payments will be created
  + resource "aws_db_instance" "db-payments" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "totem-express-pagamentos-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.4.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "totem-express-pagamentos"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "totem-express-pagamentos"
        }
      + tags_all                              = {
          + "Name" = "totem-express-pagamentos"
        }
      + timezone                              = (known after apply)
      + username                              = "postech_admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.db.aws_db_subnet_group.order_product_subnet_group will be created
  + resource "aws_db_subnet_group" "order_product_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "totem-express-produtos-pedidos-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "totem-express-produtos-pedidos-subnet-group"
        }
      + tags_all                = {
          + "Name" = "totem-express-produtos-pedidos-subnet-group"
        }
      + vpc_id                  = (known after apply)
    }

  # module.db.aws_db_subnet_group.payments_subnet_group will be created
  + resource "aws_db_subnet_group" "payments_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "totem-express-pagamentos-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "totem-express-pagamentos-subnet-group"
        }
      + tags_all                = {
          + "Name" = "totem-express-pagamentos-subnet-group"
        }
      + vpc_id                  = (known after apply)
    }

  # module.db.aws_security_group.db_order_product_sg will be created
  + resource "aws_security_group" "db_order_product_sg" {
      + arn                    = (known after apply)
      + description            = "Allow access to RDS instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/24",
                ]
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "totem-express-produtos-pedidos-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "totem-express-produtos-pedidos-sg"
        }
      + tags_all               = {
          + "Name" = "totem-express-produtos-pedidos-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.db.aws_security_group.db_payments_sg will be created
  + resource "aws_security_group" "db_payments_sg" {
      + arn                    = (known after apply)
      + description            = "Allow access to RDS instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/24",
                ]
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "totem-express-pagamentos-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "totem-express-pagamentos-sg"
        }
      + tags_all               = {
          + "Name" = "totem-express-pagamentos-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "totem-express-igw"
        }
      + tags_all = {
          + "Name" = "totem-express-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.public_routetable will be created
  + resource "aws_route_table" "public_routetable" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "totem-express-public-rt"
        }
      + tags_all         = {
          + "Name" = "totem-express-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_rt_association[0] will be created
  + resource "aws_route_table_association" "public_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_rt_association[1] will be created
  + resource "aws_route_table_association" "public_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.ssh_cluster will be created
  + resource "aws_security_group" "ssh_cluster" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "name" = "totem-express-ssh-sg"
        }
      + tags_all               = {
          + "name" = "totem-express-ssh-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_subnet.totem_express_subnets[0] will be created
  + resource "aws_subnet" "totem_express_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = true
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Application" = "totem-express"
          + "Name"        = "totem-express-subnet-0"
        }
      + tags_all                                       = {
          + "Application" = "totem-express"
          + "Name"        = "totem-express-subnet-0"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.totem_express_subnets[1] will be created
  + resource "aws_subnet" "totem_express_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.64/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = true
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Application" = "totem-express"
          + "Name"        = "totem-express-subnet-1"
        }
      + tags_all                                       = {
          + "Application" = "totem-express"
          + "Name"        = "totem-express-subnet-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.totem_express_vpc will be created
  + resource "aws_vpc" "totem_express_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/24"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @geggr, Action: `pull_request`*